ENGLISH, HANGUL = 0, 1
BASE_CODE, CHOSUNG, JUNGSUNG = 44032, 588, 28
CHOSUNG_LIST  = ['ㄱ', 'ㄲ', 'ㄴ', 'ㄷ', 'ㄸ', 'ㄹ', 'ㅁ', 'ㅂ', 'ㅃ', 'ㅅ', 'ㅆ', 'ㅇ', 'ㅈ', 'ㅉ', 'ㅊ', 'ㅋ', 'ㅌ', 'ㅍ', 'ㅎ']
JUNGSUNG_LIST = ['ㅏ', 'ㅐ', 'ㅑ', 'ㅒ', 'ㅓ', 'ㅔ', 'ㅕ', 'ㅖ', 'ㅗ', 'ㅘ', 'ㅙ', 'ㅚ', 'ㅛ', 'ㅜ', 'ㅝ', 'ㅞ', 'ㅟ', 'ㅠ', 'ㅡ', 'ㅢ', 'ㅣ']
JONGSUNG_LIST = ['', 'ㄱ', 'ㄲ', 'ㄱㅅ', 'ㄴ', 'ㄴㅈ', 'ㄴㅎ', 'ㄷ', 'ㄹ', 'ㄹㄱ', 'ㄹㅁ', 'ㄹㅂ', 'ㄹㅅ', 'ㄹㅌ', 'ㄹㅍ', 'ㄹㅎ', 'ㅁ', 'ㅂ', 'ㅂㅅ', 'ㅅ', 'ㅆ', 'ㅇ', 'ㅈ', 'ㅊ', 'ㅋ', 'ㅌ', 'ㅍ', 'ㅎ']

QWERTY = [
'`1234567890-=',
'qwertyuiop[]\\',
'asdfghjkl;\'\n',
'zxcvbnm,./',
'~!@#$%^&*()_+',
'QWERTYUIOP{}|',
'ASDFGHJKL:\"\n',
'ZXCVBNM<>?',
' ',
]

DUBEOLSIK = [
'`1234567890-=',
'ㅂㅈㄷㄱㅅㅛㅕㅑㅐㅔ[]\\',
'ㅁㄴㅇㄹㅎㅗㅓㅏㅣ;\'\n',
'ㅋㅌㅊㅍㅠㅜㅡ,./',
'~!@#$%^&*()_+',
'ㅃㅉㄸㄲㅆㅛㅕㅑㅒㅖ{}|',
'ㅁㄴㅇㄹㅎㅗㅓㅏㅣ:\"\n',
'ㅋㅌㅊㅍㅠㅜㅡ<>?',
' ',
]
